cf_billing/AccumulationRegisters/энргНачислениеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргНачислениеПени</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтавкаРефинансирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНачисленияПени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочкиСДатыНачалаНачисленийПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачисленияПени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоПени</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/энргРазделыЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргРазделыЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Взаиморасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтабильныеПериоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтабильныеПериодыМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтабильныеПериодыНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаиморасчетыНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеПомещения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргНачислениеПени/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", Регистратор.Метаданные())  Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
	
	Если ЭтотОбъект.Количество() > 0 Тогда		
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли;
			
	Если ДополнительныеСвойства.Свойство("НаборыЗаписей") Тогда
		энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей, Замещение);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	Если НЕ ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если НЕ ДополнительныеСвойства.Свойство("Организация") И ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", Регистратор.Метаданные())  Тогда
		ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("МКД") Тогда 
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("МКД", Регистратор.Метаданные())  Тогда
			ДополнительныеСвойства.Вставить("МКД", Регистратор.МКД);
		Иначе
			ДополнительныеСвойства.Вставить("МКД", Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Строение") Тогда
		ДополнительныеСвойства.Вставить("Строение", Неопределено);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Помещение") Тогда
		ДополнительныеСвойства.Вставить("Помещение", Неопределено);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ЧастныйСектор") Тогда
		ДополнительныеСвойства.Вставить("ЧастныйСектор", Ложь);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Район") И ОбщегоНазначения.ЕстьРеквизитОбъекта("Район", Регистратор.Метаданные()) Тогда
		ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
	КонецЕсли;
			
	НаборыЗаписей = Новый Структура;	
	РазделыЗаписи = Новый Массив;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачислениеПени") Тогда

		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.Взаиморасчеты, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));

	КонецЕсли;
		
	ДополнительныеСвойства.Вставить("РазделыЗаписи", РазделыЗаписи);	  
	
	ЭтоРучнойПерерасчетПени = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоРучнойПерерасчетПени", Ложь);// Удалить"ЭтоРучнойПерерасчетПени". Исправить ручной перерасчет пени
	
	Если НЕ ЭтоРучнойПерерасчетПени Тогда 
		НаборВзаиморасчеты = РегистрыНакопления.энргВзаиморасчетыПоПени.СоздатьНаборЗаписей();
		НаборВзаиморасчеты.Отбор.Регистратор.Установить(Регистратор);
		НаборВзаиморасчеты.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
		НаборыЗаписей.Вставить("энргВзаиморасчетыПоПени", НаборВзаиморасчеты);		
	КонецЕсли;
	
	Если ТипЗнч(Регистратор) <> Тип("ДокументСсылка.энргПерерасчет") Тогда
		НаборВзаиморасчеты	= РегистрыНакопления.энргВзаиморасчеты.СоздатьНаборЗаписей();
		НаборВзаиморасчеты.Отбор.Регистратор.установить(Регистратор);
		НаборВзаиморасчеты.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
		НаборыЗаписей.Вставить("энргВзаиморасчеты", 		НаборВзаиморасчеты);
	КонецЕсли;

	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);
	
КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	перем НаборВзаиморасчеты, ВзаиморасчетыПоПени, нНаборВзаиморасчеты;
	
	НаборыЗаписей = ДополнительныеСвойства.НаборыЗаписей;
	
	ЭтоРучнойПерерасчетПени = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоРучнойПерерасчетПени", Ложь);// Удалить"ЭтоРучнойПерерасчетПени". Исправить ручной перерасчет пени
	Если НЕ ЭтоРучнойПерерасчетПени Тогда
		Если НЕ НаборыЗаписей.Свойство("энргВзаиморасчетыПоПени", ВзаиморасчетыПоПени) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ НаборыЗаписей.Свойство("энргВзаиморасчеты", НаборВзаиморасчеты) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ДанныеВзаиморасчеты();
	НаборВзаиморасчеты.Загрузить(Результат.Выгрузить());

КонецПроцедуры

Функция ДанныеВзаиморасчеты()
	
	тзНаборЗаписей = ЭтотОбъект.Выгрузить(); 	
	ДополнительныеСвойства.Вставить("тзНаборЗаписей", тзНаборЗаписей);			
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Набор", тзНаборЗаписей);
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	энргНачислениеПени.Период КАК Период,
	|	энргНачислениеПени.Организация КАК Организация,
	|	энргНачислениеПени.Район КАК Район,
	|	энргНачислениеПени.МКД КАК МКД,
	|	энргНачислениеПени.Абонент КАК Абонент,
	|	энргНачислениеПени.Услуга КАК Услуга,
	|	энргНачислениеПени.ПериодРасчета КАК ПериодРасчета,
	|	энргНачислениеПени.Сумма КАК Сумма
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&Набор КАК энргНачислениеПени
	|ГДЕ
	|	НЕ энргНачислениеПени.Сумма = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	СУММА(ОбъемНачислений.Сумма) КАК Сумма,
	|	МАКСИМУМ(ОбъемНачислений.Организация) КАК Организация,
	|	МАКСИМУМ(ОбъемНачислений.Период) КАК Период,
	|	ОбъемНачислений.ПериодРасчета КАК ПериодНачисления,
	|	МАКСИМУМ(ОбъемНачислений.МКД) КАК МКД,
	|	МАКСИМУМ(ОбъемНачислений.Район) КАК Район
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Абонент,
	|	ОбъемНачислений.Услуга,
	|	ОбъемНачислений.ПериодРасчета
	|
	|ИМЕЮЩИЕ
	|	СУММА(ОбъемНачислений.Сумма) <> 0";
	
		
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

#КонецОбласти
